# Pandas

In [ ]:
import pandas as pd

In [ ]:
df = pd.Series([1,2,3,4])
print(df)

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
df = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
df2 = pd.Series([9,8,7,6], index=None)
print(df2)
print(df)

0    9
1    8
2    7
3    6
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
df.a

np.int64(1)

In [ ]:
# small condition for having a pandas series 
print(df[df > 2])

c    3
d    4
e    5
dtype: int64

In [ ]:
# converting dictionary to Pandas Series 
sdata={"Ohio":35000,"Texas":71000,"Oregon":16000,"Utah":5000}

obj3=pd.Series(sdata)
print(obj3)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

#### Data Frame

In [ ]:
data={"states":["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
      "year":[2000,2001,2002,2001,2002,2003],
      "pop":[1.5,1.7,3.6,2.4,2.9,3.2]
    }

frame=pd.DataFrame(data)
print(frame)

   states  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
frame['debts'] = np.arange(6)
print(frame)

   states  year  pop  debts
0    Ohio  2000  1.5      0
1    Ohio  2001  1.7      1
2    Ohio  2002  3.6      2
3  Nevada  2001  2.4      3
4  Nevada  2002  2.9      4
5  Nevada  2003  3.2      5

In [ ]:
frame['eastern'] = frame['states'] == "Ohio"
print(frame)

   states  year  pop  debts  eastern
0    Ohio  2000  1.5      0     True
1    Ohio  2001  1.7      1     True
2    Ohio  2002  3.6      2     True
3  Nevada  2001  2.4      3    False
4  Nevada  2002  2.9      4    False
5  Nevada  2003  3.2      5    False

In [ ]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=["Ohio","Colorado","Utah","New York"],
                 columns=["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### loc

Label based indexing

In [ ]:
data.loc['Ohio',['one','two']]

one    0
two    1
Name: Ohio, dtype: int64

#### iloc

index/number based indexing

In [ ]:
data.iloc[:2, :]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [ ]:
frame=pd.DataFrame(np.arange(8).reshape((2,4)),
                  index=["three","one"],
                  columns=["d","a","b","c"])

frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [ ]:
frame.sort_index

<bound method DataFrame.sort_index of        d  a  b  c
three  0  1  2  3
one    4  5  6  7>

In [ ]:
#axis="columns" but these are arranged like row vise
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [ ]:
frame.describe()

              d         a         b         c
count  2.000000  2.000000  2.000000  2.000000
mean   2.000000  3.000000  4.000000  5.000000
std    2.828427  2.828427  2.828427  2.828427
min    0.000000  1.000000  2.000000  3.000000
25%    1.000000  2.000000  3.000000  4.000000
50%    2.000000  3.000000  4.000000  5.000000
75%    3.000000  4.000000  5.000000  6.000000
max    4.000000  5.000000  6.000000  7.000000

### reading a file

In [ ]:
pd.read_csv("../data.csv")

    32.502345269453031  31.70700584656992
0            53.426804          68.777596
1            61.530358          62.562382
2            47.475640          71.546632
3            59.813208          87.230925
4            55.142188          78.211518
..                 ...                ...
94           50.030174          81.536991
95           49.239765          72.111832
96           50.039576          85.232007
97           48.149859          66.224958
98           25.128485          53.454394

[99 rows x 2 columns]

In [ ]:
df_temp = pd.DataFrame(np.arange(12).reshape(3,4), index=[0,1,2], columns=["Zero","One", "Two", "Three"])
print(df_temp)

   Zero  One  Two  Three
0     0    1    2      3
1     4    5    6      7
2     8    9   10     11

In [ ]:
# this creates a csv file.
df_temp.to_csv("created.csv")